[{"id":3899,"first_name":"Dries","last_name":"Verbrugge","abstract":"KNX IoT Architect working on integrating the IT world with the building infrastructure world. High interest in usability and interoperability for automation and smart buildings.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Dries-Verbrugge_QtWS17.jpg"},{"id":3890,"first_name":"Florian","last_name":"Hänel","abstract":"Florian has been part of the WebOS team since 2012 and has since worked on multiple iterations of the system compositor and related components for devices as small as a watch to as big as a fridge. His embedded Qt experience reaches back to 2010 where he was part of the Nokia Meego browser team for the N9/N950 phones.\r\nRecently he worked on projects leveraging the WebOS stack as a interactive whiteboard and signage platform and explored using WebOS in the automotive space. He holds a Diplom in computer science.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Florian-Haenel.jpg"},{"id":3887,"first_name":"Paul","last_name":"Criswell","abstract":"Paul Criswell is an Independent General Counsel, providing on-call counsel services to technology companies and other businesses.  A graduate of the University of Michigan School of Law and the Harvard Mediation Training Program, he has, during his career, been the General Counsel or Associate General Counsel for three different publicly traded companies. He has thirty-five years of experience in representing technology companies through all stages of growth, from formation to public trading. He provides advice and counsel regarding sales and marketing contracts; corporate acquisitions and divestitures; international expansion; intellectual property acquisition, protection, licensing and litigation; dispute resolution; corporate law compliance; HIPAA and privacy compliance; and employee relations and benefits issues.\r\n\r\nMr. Criswell also provides mediation, conciliation and arbitration services. Mr. Criswell mediates with the Harvard Mediation Program (HMP), where he is the Court Coordinator for the Chelsea District Court Summary Process Session.  Mr. Criswell has mediated numerous matters involving Intellectual Property infringement, landlord-tenant disputes, employment disputes, consumer complaints and civilian complaints against police officers. He has also taught mediation as part of the HMP Training Corp.   Mr. Criswell is a founding principal of ART – Alternative Resolutions for Technology -- an ADR organization providing services to the technology industry. ART has been selected by the Massachusetts Trial Courts, Superior Court Division as a Program to which it will refer matters for mediation.\r\n\r\nMr. Criswell is also Editor-in-Chief of the Communications Committee for the International Technology Law Association.  He has been an Adjunct Professor at the Massachusetts School of Law and an instructor for the Northeastern University Metropolitan Campus.  Long active in civic affairs, Mr. Criswell is Chair of the Board of Directors of the Wellesley Municipal Light Plant and a Commissioner of the Wellesley Department of Public Works.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Paul-Criswell_QtWS17.jpg"},{"id":3881,"first_name":"Justin","last_name":"Howard","abstract":"Justin is a software engineer unravelling the complex at Qualcomm’s UK design centre. He’s charged with bringing together an ever increasing range of embedded devices into a single IDE; his goal is to make sure no-one notices. With over 30 years' experience covering everything from the birth of Wi-Fi through to blowing up F1 engines, he's in a good position to achieve this.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Justin-Howard_QtWS17.jpg"},{"id":3868,"first_name":"Juha","last_name":"Varelius","abstract":"Juha Varelius Chief Executive Officer Qt Group Plc’s President and CEO since 1 May 2016. Varelius previously served as the President and CEO of Digia Plc from 2008 to 2016. Prior to joining Digia, Varelius worked in various senior executive positions in high technology companies in Finland and abroad. Varelius holds a master’s degree in Business Administration.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/JuhaV_web_600x600.jpg"},{"id":3859,"first_name":"Alex","last_name":"Montgomery","abstract":"Alex has programmed games for fifteen years, specializing in tools for eight. He has worked many roles across game development, from a network engineer for Activision, to Director of Tools Technology for Telltale Games. He now works at Amazon Games on their Lumberyard gaming components.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Alex-Montgomery_QtWS17.jpg"},{"id":3845,"first_name":"Nicolas","last_name":"Arnaud-Cormos","abstract":"Senior Software Engineer and team lead at KDAB, Nicolas has actively developed with Qt since 2001 and is a founding member of Qtfr, the French Qt community site. He has worked on multiple Qt widgets or QML projects, with a particular emphasis on API design and software architecture. He has held Qt trainings for companies such as Michelin, Ford and ST-Ericsson. Nicolas holds an MSc in Computer Science.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Nicholas-Arnaud-Cormos_QtWS17.jpg"},{"id":3844,"first_name":"James","last_name":"Turner","abstract":"Senior Software Engineer and team lead at KDAB, James has been developing with Qt since 2002. He contributes to the current maintenance of Mac platform support as well as the development of OpenGL and 3D support in Qt. James has a background in user-interface, graphics and simulation development as well as a long history of development on OS-X and prior versions of Mac OS. He is a lead developer on FlightGear, the open-source flight simulator, and holds a BSc in Computer Science.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/James-Turner_QtWS17.jpg"},{"id":3842,"first_name":"Tomasz","last_name":"Pawlowski","abstract":"Tomasz started the adventure with Squish and GUI Testing in 2011, designing and implementing automated tests for a Flight Planning solution at Lufthansa Systems. In 2014 he joined froglogic and is conducting Squish trainings and consulting for many companies in Europe and the USA. Tomasz has a degree in computer science from Nicolaus Copernicus University in Poland.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Tomasz-Pawlowski_QtWS17.jpg"},{"id":3841,"first_name":"David","last_name":"Faure","abstract":"Senior Software Engineer who also heads up KDAB's French office, David is a Qt user since its beginning. He has made numerous contributions to Qt, including new classes for QtCore in Qt 5. David is well known in the KDE project for his work on the web browser and especially on KDE Frameworks. He has taught Qt development at numerous conferences and to companies such as Michelin, Schlumberger and Orange. He has become a specialist in multithreading with Qt, as well as performance optimizations. David holds an MSc in Computer Science.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/David-Faure_QtWS17.jpg"},{"id":3840,"first_name":"Thomas","last_name":"McGuire","abstract":"Thomas is a Senior Software Engineer and team lead at KDAB. He has actively developed with Qt since 2006, when he started contributing to the open source KDE project. Since joining KDAB in 2008, Thomas has focused on QtQuick and QML, especially on embedded Linux. In addition, his interests are performance analysis and optimization, as well as modern C++. He is a contributor and approver for the Qt project. Thomas holds an MSc in Computer Science.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Thomas-McGuire_QtWS17.jpg"},{"id":3839,"first_name":"Jesper","last_name":"Pedersen","abstract":"Senior Software Engineer at KDAB, Jesper has actively developed with Qt since 1998 and initiated numerous KDE programs and components. He is the main author of the course material we use for the Qt courses and has taught more than 70 Qt classes for companies such as Boeing, IBM and Veritas. He holds an MSc in Computer Science.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Jesper-Pedersen_QtWS2017.jpg"},{"id":3836,"first_name":"Tobias","last_name":"Koenig","abstract":"Senior Software Engineer at KDAB, Tobias has actively developed with Qt since 2001 and has been an active KDE contributor during this time. His contributions have been mainly to the KDE PIM project and the KDE libraries, but also to other open source projects. He holds an MSc in Computer Science.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Tobias-Koening_QtWS17jpg.jpg"},{"id":3823,"first_name":"Matthias","last_name":"Hohmann","abstract":"Matthias Hohmann is a current PhD student at the Max Planck Institute for Intelligent Systems in Tübingen, were he focuses on building a large-scale platform for distributed brainwave studies and assistive technology. His aim is to take lab-technology to a level where it can easily be distributed to everyone.\r\n\r\nPreviously, he completed a Master's degree in Neuroscience, as well as a Bachelor's Degree in psychology with a minor in physiology. He worked alongside on several research projects in Germany and the US.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Matthias-Hohmann_QtWS17.jpg"},{"id":3813,"first_name":"Petteri","last_name":"Holländer","abstract":"Petteri is the Head of Product Management at The Qt Company. He has been with the software industry for 20 years, in different positions from Technology Consultant to CTO, from Product Group Manager to Head of Business Development.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Petteri-Hollander_QtWS17.jpg"},{"id":3808,"first_name":"Simon","last_name":"Hausmann","abstract":"Simon Hausmann is a principal software engineer with The Qt Company and maintainer of the QML library. He has been working on Qt for the past 14 years and continues to enjoy C++. He has contributed to various Qt modules such as the core libraries, the (infamous) meta-object compiler, the text renderer and the web engine.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Simon-Hausman_QtWS17.jpg"},{"id":3798,"first_name":"Maciej","last_name":"Halasz","abstract":"Maciej Halasz, Vice President of Technology at Timesys, has 17+ years of experience in embedded computing with a focus on embedded Linux and real-time systems. He is the technical lead and creator of a number of Timesys offered tools and products. Throughout his career, Maciej has worked in different roles from development to product management and has authored numerous embedded Linux and industry articles. Maciej holds a master’s degree in Computer Science, a master’s degree in Telecommunication Systems, and an MBA.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Maciej-Halasz_QtWS17.jpg"},{"id":3789,"first_name":"Johan","last_name":"Thelin","abstract":"Johan Thelin is a Qt Champion and has worked with Qt for more than 10 years. He is the author of the Foundations of Qt Development, the Qt in Education training material, numerous articles on-line as well as in printed publications. He currently works at Luxoft, building the next generation in-vehicle experiences based on open source software.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Johan-Thelin_QtWS17.jpg"},{"id":3787,"first_name":"Roger","last_name":"Mazzella","abstract":"Roger Mazzella is a Senior Product Manager for The Qt Company, in charge of Qt’s cross platform UI/UX software for the medical industry. Roger has extensive experience in product and services management, regulatory law, compliance, and marketing for the medical device and diagnostics industry.  Prior to joining The Qt Company, Roger brought state-of- the-art regulatory and clinical software applications and services to the medical device and diagnostics industry and delivered quality engineering solutions and products for numerous multinational and Fortune 500 customers.  Roger received his Master's degree in Biomedical Engineering from Worcester Polytechnic Institute, where his focus of study was on medical device design and FDA regulatory law.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Roger-Mazzella_QtWS17.jpg"},{"id":3784,"first_name":"Sascha","last_name":"Klement","abstract":"Sascha Klement is an entrepreneur, gesture technology pioneer and user experience enthusiast. He founded gestigon in 2011 with the vision in mind to get a natural user interface into every car, every home and every personal device. gestigon was established as a key player in 3D sensor-based gesture control and human behaviour tracking systems – mainly focussing on automotive applications. Starting with the first prototypes back in 2011, Sascha has shaped as the company’s CTO an engineering-focused team of today 40 team members with a worldwide customer base including automotive OEMs and suppliers as well as Augmented and Virtual Reality companies. gestigon was acquired in 2017 by the French automotive supplier Valeo. Since then, Sascha is responsible for the integration of the gestigon team into the corporate world of Valeo with the target to improve driving comfort and safety with intelligent systems from Valeo while preserving the startup mindset and innovative culture at gestigon.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Sascha-Klement_QtWS17.jpg"},{"id":3781,"first_name":"Bogdan","last_name":"Ogrean","abstract":"Bogdan is a Software Engineer with 9 years of C/C++ experience in CAD, CAM and IoT fields. For the past 6 years he has been working at Fortech, an IT services company with over 10 years of experience in software development and quality assurance services. All his time at Fortech was spent in multiple projects using Qt, covering a large range of Qt versions (4.6 to 5.9) and platforms (PC, Linux, iOS, Android). Bogdan is also one of the co-organizers for the Qt meetups in Cluj-Napoca, Romania.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Bogdan-Ogrean_QtWS17.jpg"},{"id":3772,"first_name":"Stefan","last_name":"Schürger","abstract":"Stefan Schürger is an Account Manager for Toradex AG. He holds an engineering degree in Electronics and has extensive experience in the fields of  Automotive Electronics, Distribution, Key Account Management, and Global Account Management. Stefan has previously worked for Texas Instruments, Renesas, Rutronik, and Siemens.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Stefan-Schurger_QtWS17.jpg"},{"id":3771,"first_name":"Tomislav","last_name":"Lugarić","abstract":"Tomislav Lugaric is the senior IVI Software Engineer at Rimac automobili since 2016. He has a been developing with Qt since 2010, and has a M.Sc. in Computer Science. Since starting work with Qt, he has obtained experience in various fields, including academia and military. With a strong passion for all machines that move, he quickly found his calling in the automotive industry, and is now in charge of developing and maintaining the operating system that powers IVI and M2M systems at Rimac Automobili.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Tomislav-Lugaric_QtWS17.jpg"},{"id":3767,"first_name":"Tuukka","last_name":"Turunen","abstract":"Tuukka Turunen is leading R&D at The Qt Company. He holds M.Sc.(Eng) and Licentiate of Technology from the University of Oulu, Finland. Tuukka has over 20 years of experience from various positions in the software industry, especially around embedded systems with a graphical user interface.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/tuuka-turunen.jpg"},{"id":3765,"first_name":"Sylvain","last_name":"Ekel","abstract":"Sylvain is working at Microsoft as the EMEA Manager, IoT Partner Devices & Solutions.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Sylvain-Ekel_QtWS17.jpg"},{"id":3762,"first_name":"Massimo","last_name":"Santoli","abstract":"Massimo, is an Italian Electronic Engineer, that has been working in IT since the first 90’s… passing through the different digital revolutions, and now has decided to be at the forefront of the next one, the IoT revolution.\r\n\r\nHe started in 2015 as CTO of GIMASI SA a Swiss Startup betting on the new LPWAN protocols which will jumpstart the IoT revolution. Gimasi is now a leader in LPWAN technologies with a huge experience in LoRa/LoRaWAN thanks also to partnership with Swisscom – one of the first nation operators to deliver a nationwide LoRaWAN network. Swisscom has choosen Gimasi’s Tuino IoT makers platform to help evangelize about  LoRaWAN and LPWAN. Tuino is Massimo’s vision in having an universal HW platform for IoT and Gimasi is working hard in bringing his vision also on the software side trying to deliver a platform similar to what Qt has done for UI, something that maybe very soon we could call Qt4IoT.\r\n\r\nTuino is a real universal IoT platform that covers all the current ( and future ) IoT protocols, thanks to this Gimasi is now entering the German market with Deutsche Telekom NBIoT network.\r\n\r\nMassimo works and lives, with his wonderful wife and daughter, in Mendrisio, Canton Ticino Switzerland, where he design the hardware and software behind Gimasi technologies and when not at his HQ travels throughout Europe evangelizing on the upcoming LPWAN IoT Revolution.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/Massimo-Santoli_QtWS17.jpg"},{"id":3759,"first_name":"Johan","last_name":"Helsing","abstract":"Johan is a software engineer at The Qt Company and one of the main developers of Qt Wayland.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/JohanHelsing.jpg"},{"id":3583,"first_name":"Jouko","last_name":"Luukas","abstract":"Jouko is a Director, Customer Services at The Qt Company. He has over 25 years software solution building experience with a technical background, working with software methodologies and best practises, specialised software program risk management, working as a project manager in challenging and complex projects multiple years. Now, leading Qt consultancy services in the EMEA area.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/LuukasJouko.jpg"},{"id":3714,"first_name":"Tero","last_name":"Marjamäki","abstract":"Tero Marjamäki, Head of Automotive at The Qt Company.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/08/Tero-Marjamaki_QtWS17.jpg"},{"id":3730,"first_name":"Richard","last_name":"Röjfors","abstract":"Richard goes by the title of Senior embedded open source developer at Hasselblad.\r\n\r\nRichard is a passionate open source developer. He has developed a special interest in media and graphics in the embedded space.\r\n\r\nAt Hasselblad he is responsible for media encoding/decoding, graphics rendering and compositing.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/09/RichardRoejfors.png"},{"id":3728,"first_name":"Risto","last_name":"Avila","abstract":"Risto is the senior manager of consulting at The Qt Company.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/08/Risto-Avila.png"},{"id":3721,"first_name":"Alex","last_name":"Hilliger","abstract":"Alex joined MBRDNA (Mercedes-Benz Research & Development North America Inc.) in 2010 working in the field of high performance real time graphics for head units and instrument clusters, both for show cars and products.  He was responsible for the UI/UX implementation of the Concept S-Class Coupe, the F 015 Luxury in Motion show car, and the Concept Intelligent Aerodynamic Automobile.\r\n\r\nHe manages the Advanced Graphics and Rendering team in Sunnyvale, CA. His team is closely working with designers and engineers to bring real time rendering technologies into the vehicle.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/08/Alexander-Hilliger-von-Thile.jpg"},{"id":3718,"first_name":"Michel","last_name":"Nederlof","abstract":"A self-proclaimed biohacker, Michel Nederlof is an expert in digital imaging microscopy and has been coding imaging systems to unravel cancer for the last 35 years. With an early mission to convert the world of video microscopy to digital (CCD) based camera technology, he constructed some of the worlds most advanced fluorescence microscopy systems in his garage.\r\n\r\nHe has a degree in Physics and Pattern recognition and founded 7 biotech companies focused on cancer research, diagnostics and drug discovery.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/08/Michel-Nederlof.jpg"},{"id":3702,"first_name":"Lars","last_name":"Knoll","abstract":"Lars Knoll is The Qt Company CTO and Qt Project Chief Maintainer. He has been working on Qt for more than 13 years starting as a software engineer to later leading the global Qt engineering team in Nokia before the Digia acquisition in October 2012. Lars has been an active member of the KDE community and the architect behind KDE’s HTML rendering library that formed the basis for the WebKit open source project. Lars holds a PhD in physics from the University of Heidelberg. He is German national and lives with his family in Oslo.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Lars_web_600x600.jpg"},{"id":3696,"first_name":"Ionut","last_name":"Alexandrescu","abstract":"Ionut is a serial entrepreneur, now working as Qt Advisor for The Qt Company. He studied biomedical engineering in Montreal, Canada and worked for 4 years as a Senior Software Developer at a software company in the life science and medical imaging area.  He founded two interactive media companies, one in Montreal, Canada and another one in Berlin, Germany and has more than 10 years of experience in the digital signage industry. Ionut started working with Qt in 2006 and never stopped since.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/08/IonutAlexandrescu.png"},{"id":3692,"first_name":"Jeff","last_name":"LeBlanc","abstract":"Jeff is the Director of User Experience (UX) at Integrated Computer Solutions, Inc. (ICS), which specializes in developing world-class, implementable designs for touch-enabled devices. He has extensive experience developing custom software solutions with a strong focus on applying human factors principles to user-interface design. He earned both his BS and MS in Computer Science from Worcester Polytechnic Institute (WPI) where he is also an adjunct faculty member. In his free time Jeff enjoys kayaking, archery, and hiking the White Mountains of New Hampshire with his rescue dog, Alex.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/08/Jeff-LeBlanc_QtWS17.jpg"},{"id":3585,"first_name":"Santtu","last_name":"Ahonen","abstract":"Santtu works in The Qt Company as product manager of the Qt for Device Creation. Santtu has over 20 years of experience in product management on various high technology products including Nokia Maemo as Head of Developer Offering Product Management where Qt was essential part of the plan. Santtu joined back in to Qt technology and The Qt Company in spring 2017.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Santtu-Ahonen_QtWS17-.jpg"},{"id":3616,"first_name":"Takayuki","last_name":"Tanabe","abstract":"Mr. Tanabe is CEO for Panasonic ITS and heads the Development center which has SW, HW and Mechanical section. Panasonic ITS has been developing IVI system and various ECU since 2000. Recently they also develop battery management system and e-cockpit system including HUD, digital meter and ADAS.\r\n\r\nPrior to having the role of CEO in Panasonic ITS, Mr. Tanabe spent the previous 7 years at Panasonic Automotive & industrial systems Europe(PAISEU) in Germany  and  leaded the Software Development Center as Assistant Director. He met TQC during this period.\r\n\r\nMr. Tanabe has 20 year's experience in large-scale software development in Automotive system globally (EU, US, JP).","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Tanabe_web_600x600.jpg"},{"id":3587,"first_name":"Christoph","last_name":"Sterz","abstract":"Christoph Sterz holds a Master's Degree in IT-Systems-Engineering. In his work time at KDAB, he develops and analyzes automotive software—in his spare time Christoph organizes youth academies and teaches coding to young kids.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Christoph-Sterz_QtWS17.jpg"},{"id":3581,"first_name":"Andreas","last_name":"Cord-Landwehr","abstract":"Andreas Cord-Landwehr is a development engineer at CLAAS E-Systems. He works on embedded devices for user terminals that control big agriculture machines like tractors and combine harvesters. Since 2011, he is also a member of the KDE Community and since then primarily contributed to KDE's educational software applications.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Cord-Landwehr-Andreas.jpg"},{"id":3579,"first_name":"Lars","last_name":"König","abstract":"Head of Automation at The Qt Company","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Lars-Konig-1.png"},{"id":3576,"first_name":"Marc","last_name":"Mutz","abstract":"Marc is a Senior Software Engineer with KDAB and author of the “Effective Qt” series of articles. He originated KDAB’s “In-depth Multithreading With Qt”, C++11 and C++17 courses, and runs “-Wmarc”, a blog about Qt, C++ and Boost. The second-most prolific contributor to QtBase and maintainer of the QtWidgets module, he has actively used the framework for more than a decade, first as a KDE contributor, and then on the job. His most recent contribution to Qt is QStringView, a revolutionary abstraction of string data from containers. Marc is a sought-after speaker at conferences on Qt and C++ topics and holds an MSc in Theoretical Physics.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Marc-Mutz_QtWS17.jpeg"},{"id":3573,"first_name":"Burkhard","last_name":"Stubert","abstract":"Burkhard has been working with Qt ever since version 1.44 back in 1999. He has developed quite a few embedded and desktop applications with Qt and QML. His major products include driver terminals for forage and sugar root harvesters, infotainment systems for US and European car OEMs, an in-flight entertainment system and a display computer for e-bikes. He has worked as an evangelist for Nokia's Qt team and has convinced well-known companies from the automotive, STB/TV and home appliance industry to use Qt. He was the first to give QML trainings back in early 2010, when QML was still far away from an alpha release. The business connections from his Nokia times made it easy for Burkhard to quit his permanent job four years ago and to start working as an independent software developer.\r\n\r\nHe offers professional services for developing embedded systems - preferably with a QML GUI and Qt/C++ middleware. Burkhard worked and lived in India, England and Norway and moved back to his native country, Germany, a couple of years ago. In his spare time, he is hiking, biking and skiing through the Bavarian Alpes.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Burkhard-Stubert_QtWS17.jpg"},{"id":3571,"first_name":"Jeffrey","last_name":"Brendecke","abstract":"A fascination with data processing and presentation led Jeffrey Brendecke from the world of environmental science into the realm of software. After a career at Microsoft with a focus on integrated documentation quality control, he managed a team of mobile application developers at a German company, where he became frustrated with having to \"triplicate\" work by designing mobile applications for three platforms. Already enthralled with C++ as a programming language, he sees Qt/QML as the promising platform for making cross-platform applications a reality, especially in this day and age of when the user experience is increasingly becoming an immersive interaction with dynamic pictures.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Jeffrey-Brendecke_QtWS17.jpg"},{"id":3569,"first_name":"Marco","last_name":"Piccolino","abstract":"Marco Piccolino is a consultant developing Qt apps, usually targeting mobile platforms (Android, iOS). He is the founder of the QtMob Slack chat, a community of Qt mobile application developers (http://slackin.qtmob.org) with a focus on resource sharing and problem solving. His main professional interests include application architecture models, test-driven development and everything Qt.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Marco-Piccolino_QtWS17.jpg"},{"id":3566,"first_name":"Maciej","last_name":"Węglarczyk","abstract":"Maciej Węglarczyk is a Senior Software Engineer at GameDesire where he develops mobile games since 2011. His interests are not only technical (including clean code and application architecture), but also UX and the development process itself - having Scrum Master and Product Owner certification broadens his perspective on making games. Qt evangelist since he recalls (that is - 2008), using it for his private and (lastly) professional projects.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Maciej-Weglarczyk_QtWS17.jpg"},{"id":3563,"first_name":"Harri","last_name":"Porten","abstract":"Harri Porten is co-founder and co-CEO of froglogic GmbH, a company that has specialized on automated testing tools for Qt programmers. After learning about Qt through his involvement with the Open Source KDE Community Harri was working as a Senior Software Engineer at the Trolltech, the original makers of Qt in Oslo.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Harry-Porten_QtWS17.jpg"},{"id":3562,"first_name":"Paul","last_name":"Lemire","abstract":"Senior Software Engineer at KDAB, Paul is a Qt approver and active contributor to the Qt 3D module where he is one of the main developers. He has been developing Qt based C++ and QML applications since 2010 and has particular interest and expertise in OpenGL and GPU assisted computing. Paul holds a Master’s degree in Computer Science.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Paul-Lemire_QtWS17.jpg"},{"id":3560,"first_name":"Laszlo","last_name":"Agocs","abstract":"Laszlo is a senior software engineer at The Qt Company in Oslo, Norway. After working on UI frameworks on various Nokia mobile platforms and developing mobile GPUs at ARM, he is now working full time on Qt. His focus is on graphics and windowing system integrations, in particular on devices running Embedded Linux. However, in a true cross-platform Qt spirit, he is not afraid of other platforms either. He is a major contributor to QtGui and QtQuick, and is the maintainer of the embedded-focused linuxfb and eglfs platform plugins.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Laszlo-Agocs_QtWS17.jpg"},{"id":3558,"first_name":"Andy","last_name":"Nichols","abstract":"Andy Nichols is a senior software engineer at The Qt Company in Oslo, Norway. He has worked with Qt for the last 10 years. Andy was a Qt support engineer at Nokia for 3 years who focused on customers using Qt for Embedded Linux. He later took a role as a software engineer at Nokia with the Qt graphics team where he worked on the Qt Platform Abstraction (QPA) in Qt 5 as well as the QtWayland module. Since joining The Qt Company he has been focused on Wayland, Multimedia, the Qt Quick 2D Renderer, and the Embedded Linux and iOS ports. Andy’s current focus is on the Qt Quick graphics stack and Embedded Linux.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Andy-Nichols_QtWS17.jpg"},{"id":3551,"first_name":"Sami","last_name":"Makkonen","abstract":"Sami Makkonen is a Product Manager working at The Qt Company. Sami holds an M.Sc.(Econ.) degree in Computer Science from the University of Jyväskylä. Sami has been working in Digia and The Company for 19 years in different roles from development to program and product management. Sami has been working with Qt since 2006.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Sami-Makkonen_QtWS17.jpg"},{"id":3547,"first_name":"Adrien","last_name":"Leravat","abstract":"Qt technical lead and trainer, Adrien guides our customers on software architecture, team organization and tools, solution implementation and with dedicated expertise. Speaker at several occasions at Qt events and other embedded shows and conferences, his key skills are the creation of cross-platform and cross-product architectures, boot and performances optimization as well as software graphics and ergonomics (UI/UX).","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Adrien-Leravat_QtWS17.jpg"},{"id":3512,"first_name":"Igor","last_name":"Beuker","abstract":"Igor Beuker is an energetic professional communicator with a proven track record as keynote speaker and host, award-winning marketing strategist for global brands like Nike, Amazon, L’Oréal and Unilever, new-breed trendwatcher for Fortune 500s, serial entrepreneur with multiple exits on his belt, and angel investor.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Igor_web_600x600.jpg"},{"id":3024,"first_name":"Dr. Steven","last_name":"Goldfarb","abstract":"Dr. Steven Goldfarb is a physicist from the University of Melbourne working on the ATLAS Experiment on the Large Hadron Collider at CERN. He received his Ph.D. in physics from the University of Michigan in 1991, and has been performing particle physics research at CERN ever since.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/03/Steven_web_2_600x600.jpg"},{"id":3022,"first_name":"Linda","last_name":"Liukas","abstract":"Linda Liukas is the author and illustrator of Hello Ruby, a children’s picture book about the whimsical world of computers, as well as the founder of Rails Girls, a global movement to teach young women programming in over 260 cities.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Linda_web_600x600.jpg"},{"id":3020,"first_name":"Herb","last_name":"Sutter","abstract":"Herb Sutter is the chair of the ISO C++ committee and a native languages architect at Microsoft. His current work is focused on making C++ more powerful while also making C++ code simpler and cleaner, with the goal of modernizing the language for the 2020s and beyond.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/03/Herb_web_2_600x600.jpg"},{"id":2970,"first_name":"Thomas","last_name":"Boutroue","abstract":"Thomas Boutroue is a long-time Qt & QML developer, interested mainly in two topics : * Producing nice UI, to be really useful to users, while avoiding the pure eye-candy clutter, thus provide decoration and effects when it's useful and not just beautiful. * Producing nice code, by all means possible, to ease up maintenance, by using modern coding technics and some sort of \"code hygiene\". During more than a decade, he developed a lot of visual applications, along with a handful of libraries to help himself and others to develop apps faster, with better and stronger code quality. Today an independant Qt&QML expert developer and trainer, he is willing to share the experience he has accumulated over the years.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Thomas-Boutroue_QtWS17.jpg"},{"id":2969,"first_name":"Nuno Filipe Magalhães","last_name":"Santos","abstract":"Nuno Santos is a multidisciplinary software engineer working in the industry since 2007. He has the ability to quickly learn everything he needs to accomplish a new task. As a goal oriented person he takes new projects very seriously focusing it's energy on their success. Natural born entrepreneur, he has developed projects in several different areas: web applications, multimedia applications, desktop applications, mobile applications and embebbed devices. In 2014, he has founded Imaginando, company that combines music with technology to create inspiring musical experiences.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Nuno-Santos_QtWS17.jpg"},{"id":2968,"first_name":"Friedemann","last_name":"Kleint","abstract":"Friedemann Kleint joined the Trolltech Berlin office in 2006 after being introduced to Qt 3 in 2000. He worked on Qt Designer, various parts of Qt Creator, the Qt 5 Windows platform plugin and started on PySide2 one year ago. When not hacking, he can be found cycling, in-line skating or swimming in the surroundings or Berlin or taking pictures with various ancient cameras.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Friedemann-Kleint_QtWS17.jpg"},{"id":2967,"first_name":"Cosmin","last_name":"Lazar-Zahacinschi","abstract":"Cosmin is an architect and team lead at Fortech, an IT services company with over 10 years of experience in software development and quality assurance services for the American and Western European markets. He is using Qt since 2012, first in the Automotive industry developing high-end infotainment systems and, afterwards, in more diverse domains like mobile. In the past year he is working mostly in the e-bike domain providing connectivity solutions using the Qt framework.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Lazar-Cosmin_QtWS17.jpg"},{"id":2966,"first_name":"Frank","last_name":"Meerkötter","abstract":"Frank is the development lead at basysKom GmbH where he is providing expertise on system & software architecture in the Qt/C++ area. He has over ten years of experience working with a wide range of Embedded Linux based systems often in combination with Qt.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Frank-Meetkoetter_QtWS17.jpg"},{"id":2965,"first_name":"Giuseppe","last_name":"D'Angelo","abstract":"Software Engineer at KDAB, Giuseppe is a long-time contributor to Qt, having used Qt and C++ since 2000, and is an Approver in the Qt Project. His contributions in Qt range from containers and regular expressions to GUI, Widgets and OpenGL. A free software passionate and UNIX specialist, before joining KDAB, he organized conferences on opensource around Italy. He holds a BSc in Computer Science.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Giuseppe-DAngelo_QtWS17.jpg"},{"id":2964,"first_name":"Morten Winkler","last_name":"Jørgensen","abstract":"After bailing out of his Ph.D thesis, Morten has worked as a software engineer in multiple fields and disciplines and currently he is one of the Qt experts at Viking Software. Previously Morten has programmed machines for the food industry, user interfaces for cell phones at Nokia, chat systems at Atlassian and agricultural machines at Leica. He has been freelancer selling Qt services and prototype implementation for as well industrial research as startups in the biochemical industry. With 13 years of work in a variety of businesses and technologies, having Qt as a common thread, Morten considers experience the new black.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Morten-Jorgensen_QtWS17.jpg"},{"id":2963,"first_name":"Eric","last_name":"Bader","abstract":"Jen Trieu: Jen has been a professional software developer for over 8 years. She has held positions as Lead Software Developer and Lead Product Engineer, as well as Scrum Master for many projects. She is currently the Lead Product Engineer and Product Owner at Esri for the ArcGIS Runtime SDK for Qt product. Jen holds a Bachelor of Computing and Software Design degree (Honors) from Queen's University in Canada. Eric Bader: Eric has worked in the field of GIS since 1991 in a wide range of technical areas, ranging from technical software product management, software product development, and application development. Currently he works for Esri as a Technical Product Manager for the ArcGIS Runtime SDKs in Redlands, California.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Eric_Bader_QtWS17.jpg"},{"id":2962,"first_name":"Muhammet Ali","last_name":"Asan","abstract":"Muhammet is a Software Engineer and Graduate Computer Science Student with 5 years of experience in C++/Qt. He holds bachelor degree in Electrical Engineering and minor degree in Computer Science.He works for Turkey's leading defence&technology company STM where he involved in several Command&Control System projects with in strategic cooperation of NATO.He has always been interested in automotive and is now enthusiastic about development software for modern vehicles with his favorite development framework Qt.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Muhammet-Ali-Asan_QtWS17.jpg"},{"id":2961,"first_name":"Paolo","last_name":"Angelelli","abstract":"Paolo Angelelli is a member of the graphics and multimedia team at The Qt Company in Oslo. He's passionate about Qt, graphics and multimedia. He has a background in data visualization and his currently focus is on QtLocation. In his spare time he enjoys tennis and hacking together Qt applications.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Paolo_Angelelli_QtWS17.jpg"},{"id":2960,"first_name":"Lucie","last_name":"Gerard","abstract":"Lucie Gerard is a software developer at the Qt company, working on home automation. She has over 10 years of experience using C++ to develop models and analysis in the field of very high energy astrophysics. She holds a PhD in Physics.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/man-silhouette-black-gray.jpg"},{"id":2959,"first_name":"Müge","last_name":"Kural","abstract":"Muge Kural is an engineer with BSc degree of Computer Engineering from Koc University, Turkey. Currently, she is a software developer in a software company named Eteration for 8 months and working for cloud solutions on embedded devices. Previously she worked on a different range of projects from 3D modelling to web applications. She has passion about abstract mechanisms and structures which fits her characteristics with her job.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Muge-Kural.jpg"},{"id":2958,"first_name":"Mike","last_name":"Krus","abstract":"Senior Software Engineer at KDAB, Mike has been developing with C++ since 1996 and Qt since 2004. He has a broad range of experience in scientific applications, mainly in civil engineering and oil & gas industries. His range of expertise includes C++, QML and interactive 3D visualization software design on desktop and mobile as well as MacOS development. Mike is the Qt maintainer for the tvOS platform and is very interested in building mobile applications with Qt, mainly on iOS. He has a PhD in Computer Science.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Mike-Krus_QtWS17_v2.jpg"},{"id":2957,"first_name":"Bruno de Oliveira","last_name":"Abinader","abstract":"Bruno is a software engineer at Mapbox. Bruno has contributed to various upstream projects, and is passionate by new and creative technologies, especially when they fit into the open source, community-oriented world. He is an expert in Qt and brings his experience with parallel programming to build the fastest mapping library for phones and the web. Before joining Mapbox, Bruno was hacking browser engines at Samsung and is one of the top contributors of the Servo engine, the new open source browser engine from Mozilla written in Rust. Major upstream contributions include Qt, KDE, Mozilla Servo, Google Chrome (Blink), Apple WebKit and Mapbox GL Native.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Bruno-Abinader_QtWS17.jpg"},{"id":2956,"first_name":"Jake","last_name":"Petroules","abstract":"Jake Petroules is a software engineer and product manager for Qbs at The Qt Company in California. He has worked with Qt for over 7 years. Jake started contributing to Qt in 2012, focusing on the development of Qbs as well as the macOS and iOS ports. He later joined The Qt Company, helping customers to achieve success with Qt, and is currently the maintainer of Qt's watchOS platform port and qmake build system support for all Apple Platforms. Right now he is focused on developing exciting new features and planning the roadmap and strategy for Qbs while helping to port Qt to use Qbs as its build system, in addition to his other responsibilities.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Jake-Petroules_QtWS17.jpg"},{"id":2955,"first_name":"Volker","last_name":"Krause","abstract":"Volker started working with Qt and contributing to KDE back in 2002. He maintained KDE's personal information management service Akonadi for a few years and in 2010 he started the GammaRay project, to address the need for (by then not yet existing) QML debugging tools. Volker is a Qt approver and works as software engineer, consultant and trainer at KDAB, and leads KDAB's contributions to the Qt Automotive Suite.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Volker-Krause_QtWS17.jpg"},{"id":2954,"first_name":"Dr Sean","last_name":"Harmer","abstract":"Dr Sean Harmer is a Senior Software Engineer at KDAB where he heads up the UK office and also leads the 3D R&D team. He has been developing with C++ and Qt since 1998 and is Qt 3D Maintainer and lead developer in the Qt Project. Sean has broad experience and a keen interest in scientific visualization and animation in OpenGL and Qt. He holds a PhD in Astrophysics along with a Masters in Mathematics and Astrophysics.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Sean-Harmer_QtWS17_v2.jpg"},{"id":2953,"first_name":"Alex","last_name":"Leutgöb","abstract":"Alex Leutgöb is Co-Founder of Felgo GmbH. Equipped with a business and technical background Alex specialized in mobile app development in 2008 when the first app store launched. Since then he published several apps for customers reaching from small companies to multinational enterprises. With a profound knowledge for the mobile platforms iOS, Android, BlackBerry, Windows Phone, Symbian and MeeGo his apps were downloaded more than a million times. Because of this variety of platforms he began to evaluate several possibilities for cross platform development, which finally led to switching his focus on cross-platform mobile game creation with Qt and QML in 2011, when Felgo was born. Later his gained knowledge led to the creation of Felgo Qt 5 Plugins & Felgo Apps. Previous Presentation Experience: As Co-Founder of Felgo GmbH Alex regularly speaks at public events presenting the Felgo. As an expert for mobile app development, he hold presentations about introduction to Qt programming, iOS and Android application development. He gave a lightning talk at Qt World Summit 2015 and Qt Developer Days in Berlin in 2014, speaking about integrating native functionality within the Qt ecosystem. During his studies he worked as a tutor for programming at Vienna University of Technology and gave regular presentations to computer science students.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Alex-Leutgob_QtWS17.jpg"},{"id":2952,"first_name":"Christian","last_name":"Feldbacher","abstract":"Christian Feldbacher is Co-Founder of Felgo GmbH. He has more than 15 years’ experience in software development with a strong focus on game and mobile app development for all kinds of platforms including native Symbian, Java ME, iOS, Android, MeeGo, and BlackBerry. After 15 years C++ and 10 years Qt C++ development, Christian was overwhelmed by Qt Quick and the combination of performance and code efficiency. His passion for games and experience in Qt, game, and mobile platform development led to the creation of Felgo which was publicly launched in January 2013. Besides working on Felgo, Christian joins game jams and teaches university students how to develop with Qt. Previous Presentation Experience: Christian gave 5 talks about cross-platform app development with Qt at Qt World Summit 2016, 2015 and 2014. He presented a lightning talk at 2013’s Qt Developer Days in Berlin, where he won the “Most Innovative Talk” award. Christian has started to work as a tutor for programming and mathematics during his Bachelors and Master’s degree and presented complex topics on a weekly regular basis. After finishing the Mobile Computing Master program, he started to work as a lecturer on the University of Applied Sciences Hagenberg, teaching Bachelor and Master students cross-platform development with Qt. Besides presentations for students as a teacher, he often speaks on big public events. Examples are Global Game Jam Austria, Knowledge Night about Cross-Platform Development or Game Stage in Ars Electronica Center. As Co-Founder of Felgo, he also presents Felgo on conferences and Startup competitions on a regular basis, like at Game Developers Conference in Cologne or a talk at Microsoft Headquarter in Austria about cross-platform development with Qt.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Christian-Feldbacher_QtWS17.jpg"},{"id":2951,"first_name":"Bo","last_name":"Thorsen","abstract":"Bo has been a Qt developer for over 20 years, writing Qt based applications of all sorts and varieties. He is very well known in the Qt community from giving World Summit talks and helping out on the Qt mailing lists. He is an experienced speaker that always gives the audience a presentation packed full of the deep knowledge coming from true expertise in a very entertaining way. Today, he leads Viking Software, a Qt based consulting company.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Bo-Thorsen_QtWS17.jpg"},{"id":2950,"first_name":"Nazar","last_name":"Babik","abstract":"Nazar has been working on commercial projects since 2005. He has experience in development of back-end and front-end applications and services. Working on many projects like VoIP application, real-time data processing layers and some embedded. Now he is working as a Qt consultant for Viking Software.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Nazar-Babik_QtWS17.jpg"},{"id":2949,"first_name":"Giulio","last_name":"Camuffo","abstract":"Giulio Camuffo is a software engineer at KDAB and has been using Qt for many years. He has a focus on graphics related programming, is a Wayland developer and one of the main developers of the QtWayland Qt module.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Giullio-Camuffo_QtWS17.jpg"},{"id":2947,"first_name":"Jereme","last_name":"Givens-Lamothe","abstract":"Jereme is a Senior Software Architect at DocBox, and has been using Qt professionally for more than 9 years. After graduating Saint Michael's College with a BS in Computer Science in 2008, he joined Physician's Computer Company to help create a Pediatrics focused EHR. Since 2013 he has been at DocBox, working on the HMI and clinical app platform, with the goal of enabling data driven healthcare.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Jereme-Lamothe_QtWS17.jpg"},{"id":2946,"first_name":"Ekkehard","last_name":"Gentz","abstract":"Ekke is Qt Champion 2016 and works as Independent Software architect in the domain of business applications (ERP). He has over 30 years of experience in the domain. He likes to develop high quality mobile apps for customers around the world. Ekke is a well-known speaker in national and international developer conferences, he writes articles and blogs at http://ekkes-corner.org. On Twitter he is @ekkescorner. Find more info on native mobile app development at http://appbus.org, which also has a special blog series about x-platform Qt development http://j.mp/qt-x. Ekke lives in the south of Germany and in his spare time he likes to go backpacking to the Greek islands.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Ekkehard-Gentz_QtWS17.jpg"},{"id":2945,"first_name":"Stefan","last_name":"Agner","abstract":"Stefan is a Senior Linux Developer Engineer for Toradex in Switzerland. He is an open source enthusiast with many years experience as a Linux, Kernel developer. Stefan has extensive knowledge in Real-Time Linux and Heterogeneous Multicore Processing. Before joining Toradex, he was controlling industrial lasers with Real Time Linux. He holds a Master of Science in Computer Science from the University of Washington.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Stefan-Agner_QtWS17.jpg"},{"id":2944,"first_name":"Roland","last_name":"Wienen","abstract":"Having dedicated his whole life to software development, Roland created his first ERP System for his aunt’s flower shop at the young age of fourteen. In 1992 then, he got his first professional job as a programmer. That is 25 years of experience in software development now. In 2004 Roland founded his first own business, and second one in 2012. The former to the purpose of implementing software in the health care sector, and the later to develop cloud-ready ERP systems. To broaden his skills in driving businesses, Roland went back to school in 2012. Now he holds a master degree in leading innovation and change from the York St John University. Right at the end of last year, Roland acquired a software manufacturing firm, developing solutions for the health care industry. This company he will lead with passion to a new era of mobile first applications. The 25.000 customer end-users cannot await to get it. The first of these applications will be in focus on this conference. Roland lives in Germany, near the Dutch border with his wife and his two kids.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Roland-Wienen_QtWS17.jpg"},{"id":2943,"first_name":"Jan Arne","last_name":"Petersen","abstract":"Jan Arne Petersen works as a Senior Software Engineer at KDAB. He was involved in the development of the virtual keyboard for the Nokia N9. He is the Maintainer of the Wayland input method protocols and Maintainer of the Maliit Virtual Keyboard.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Jan-Arne_QtWS17.jpg"},{"id":2942,"first_name":"Mathias","last_name":"Hasselmann","abstract":"Mathias is a passionate, professional software developer at KDAB, writing Linux code for two decades now. Before fighting dragons at KDAB he implemented personal information components for Nokia’s Maemo and Meego phones.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Mathias-Hasselmann_QtWS17.jpg"},{"id":2941,"first_name":"Matthew","last_name":"Hungerford","abstract":"Matthew Hungerford is a Embedded Engineer at ChargePoint. He is a Linux enthusiast, developing on Linux both on the clock at companies such as Skype, Microsoft and now ChargePoint, as well as in his free time writing simple games for his son and hacking on Arduinos and Raspberry Pis.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Matt-Hungerford_QtWS17.jpg"},{"id":2940,"first_name":"Vladimir","last_name":"Moolle","abstract":"Vladimir Moolle is responsible for managing the Integrated Computer Solutions' European team; Vladimir co-authored Integrated Computer Solutions' \"Effective QML\" training course.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Vladimir-Moolle_QtWS17.jpg"},{"id":2939,"first_name":"Krzysztof","last_name":"Krzewniak","abstract":"Krzysztof Krzewniak is a Qt Consulting Engineer at Integrated Computer Solutions and has been developing QML-based IVIs for several years.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Krzysztof_QtWS17jpg.jpg"},{"id":2938,"first_name":"Olivier","last_name":"Goffart","abstract":"Olivier Goffart started working with Qt 15 years ago with his involvement in KDE. He was then hired by Trolltech to work on Qt in 2007 and has been working on various areas of Qt including the itemview framework, the widget stylesheets, QtScript, the QObject internals, and the QML debugger for Creator. He is still contributing to Qt and maintains moc. His interests in compiler even lead him to be an occasional Clang contributor. He is now the co-founder of Woboq, a company based in Berlin focusing on Qt.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Speaker-Olivier-Goffart.jpg"},{"id":2937,"first_name":"Shawn","last_name":"Rutledge","abstract":"Shawn Rutledge has been a Qt user since 2004, having started writing an application for a Qtopia phone, and afterwards worked on a Qt-based automotive diagnostic tool, and other smaller projects. He has been a Qt developer at the Qt Company Oslo office since 2011, and a maintainer of Qt Quick since 2016.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Rutledge-Shawn_QtWS17.jpg"},{"id":2936,"first_name":"Alexey","last_name":"Rusakov","abstract":"The author is a long-time software developer, solution architect, and FLOSS enthusiast. His experience includes a SoC assembly translator in Pascal in 90's, a bioinformatics search portal in C++ in 2000's, and several enterprise solutions in Java and hacking for fun with Qt more recently. His current main job is concerned with operations support systems for large telco operators; but he spends most of spare time on Quaternion, a Qt/QML-based instant messaging client for Matrix, a collaboration platform actively evolving in the last couple of years.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Alexey-Rusakov_QtWS17_v2.jpg"},{"id":2935,"first_name":"Hirotaka","last_name":"Suzuki","abstract":"Hirotaka Suzuki, “hiro” in short, a tech & design enthusiast with 20 years of experience in the industry, serves as the CTO of sdtech inc., a professional HMI production team of designers and engineers. Before founding sdtech inc., he has been serving as the CTO of HI Corporation where he led the R&D team. He believes in the idea that design and engineering are not separate phases of development process but just different aspects of a single unified development process. He has been working on bringing this idea, “Design Engineering”, to the real mass production process in automotive industry, and he believes that this is the only way to create something really attracts users.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Hirotaka-Suzuki_QtWS17.jpg"},{"id":2933,"first_name":"Jesus Fernandez","last_name":"Prieto","abstract":"He joined to The Qt Company in 2016. Before joining The Qt Company he worked in important companies of the software and game industry like Gameloft, Hewlett-Packard. He is also the maintainer of the QtNetworkAuth module.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Jesus-Fernandez_QtWS17.jpg"},{"id":2934,"first_name":"Maurice","last_name":"Kalinowski","abstract":"Maurice Kalinowski works for the Qt Company as Principal Software Engineer. He started at Trolltech GmbH in Germany in 2006, working on the initial Windows CE 5 port. Following that he worked on multiple areas in regards to developer offering in Nokia: Qt Simulator, Qt Installer Framework, and (Nokia) Qt SDK and in R&D management in Digia. Lately he became Maintainer for the Windows Runtime platform, including Universal Apps.","avatar":"https://s3-eu-west-1.amazonaws.com/qt-worldsummit/ws2017/uploads/2017/06/Maurice-Kalinowski_QtWS17.jpg"}]
